//
//  main.c
//  0212-格式化输出
//
//  Created by Enrica on 2018/3/27.
//  Copyright © 2018年 Enrica. All rights reserved.
//

#include <stdio.h>

/**
 * 格式化整数和浮点数并显示
 */

int main(void) {
    
    printf("[%d]\n", 123);  // 原样输出整数，结果为[123]
    printf("[%.4d]\n", 123);  // 保留4位小数位(因为整数没有小数，所以如果位数不足，会在前面补0：[0123])
    printf("[%4d]\n", 123);  // 显示4个字符的宽度，结果为[ 123]
    printf("[%04d]\n", 123);  // 使用0标志，并且保留4个字符的宽度，结果为[0123]
    printf("[%-4d]\n\n", 123);  // 保留4个字符的宽度，并且实现左对齐，结果为[123 ]
    
    printf("[%d]\n", 12345);  // 原样输出，结果为[12345]
    printf("[%.3d]\n", 12345);  // 保留3位小数，结果为[12345]
    printf("[%3d]\n", 12345);  // 显示3个字符的宽度，结果为[12345]
    printf("[%03d]\n", 12345);  // 使用0标志，并且保留3个字符的宽度，结果为[12345]
    printf("[%-3d]\n\n", 12345);  // 保留3个字符的宽度，并且左对齐，结果为[12345]
    
    printf("[%f]\n", 123.13);  // 原样输出，结果为[123.130000]
    printf("[%.1f]\n", 123.13);  // 表刘1位小数，结果为[123.1]
    printf("[%6.1f]\n", 123.13);  // 显示6个字符的宽度，并且保留1位小数，结果为[123.1]
    
    printf("[%f]\n", 123.13);  // 原样输出，结果为[123.130000]
    printf("[%.1f]\n", 123.13);  // 保留1位小数，结果为[123.1]
    printf("[%4.1f]\n", 123.13);  // 保留4个字符的宽度，并且保留1位小数，结果为[123.1]
    
    return 0;
}
