//
//  main.c
//  0513-多维数组
//
//  Created by Enrica on 2018/3/29.
//  Copyright © 2018年 Enrica. All rights reserved.
//

#include <stdio.h>

/**
 * 求4名学生在两次考试中3门课程的总分
 */

int main(void) {
    
    int i, j;
    
    // 4名学生3门课程第一次考试的成绩
    int first[4][3] = {{91, 63, 78}, {67, 72, 46}, {89, 34, 53}, {32, 54, 34}};
    
    // 4名学生3门课程第二次考试的成绩()
    int second[4][3] = {{97, 67, 82}, {73, 43, 46}, {97, 56, 21}, {85, 46, 35}};
    
    // 4名学生3门课程的总成绩
    int sum[4][3];
    
    puts("第一次考试时的分数: ");
    
    // 先遍历学生
    for (i = 0; i < 4; i++) {
        
        printf("第%d位学生第一次考试，3门功课的成绩分别为: ", i);
        
        // 再遍历该学生的学科成绩
        for (j = 0; j < 3; j ++) {
            printf("%d ",first[i][j]);
        }
        putchar('\n');
    }
    
    puts("\n第二次考试时的分数: ");
    
    // 先遍历学生
    for (i = 0; i < 4; i++) {
        
        printf("第%d位学生第二次考试，3门功课的成绩分别为: ", i);
        
        // 再遍历该学生的学科成绩
        for (j = 0; j < 3; j ++) {
            printf("%d ",second[i][j]);
        }
        putchar('\n');
    }
    
    // 计算两次得分之和
    for (i = 0; i < 4; i++) {
        for (j = 0; j < 3; j++) {
            sum[i][j] = first[i][j] + second[i][j];
        }
    }
    
    puts("\n该学科第一次考试和第二次考试的总分为: ");
    
    // 先遍历学生
    for (i = 0; i < 4; i++) {
        
        printf("该生、该学科两次考试的总分分别为:");
        
        // 再遍历学科
        for (j = 0; j < 3; j++) {
            printf("%4d", sum[i][j]);
        }
        putchar('\n');
    }
    
    return 0;
}


/**
 * (1)、所谓多维数组，就是多个数组集合在一起形成的数组，即元素本身是数组的数组；
 * (2)、以数组作为元素的数组是二维数组，以二维数组作为元素的数组是三维数组，依次类推；
 * (3)、多维数组是以数组作为元素的数组，相对应的，元素不是数组的数组被称为一维数组；
 * (4)、构成数组最小单位的元素被称之为构成元素，一维数组和多维数组它们所有的构成元素在内存上是排列成一条直线的；
 * (5)、多维数组的构成元素在排列时，是从末尾的下标开始递增的，eg a[0][0]、a[0][1]、a[0][2] ... a[n][n].
 */
